---
kind: other
id: Operators.T:Autodesk.Revit.DB.ExternalService.ExternalServiceId
source: html/bca6b71b-928e-bbda-60c7-7ff65efb0f43.htm
---
# ExternalServiceId Operators

Compares two ExternalServiceId instances.